КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная/КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная</name>
  <posting>Deny</posting>
  <attributes>
    <name>ЗаказЗаявкаОснование</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул1</types>
    </type>
  </attributes>
  <attributes>
    <name>kl_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УИД</name>
    <comment>Уникальный идентификатор, выданный ГИС Минтранса</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТрН</name>
    <comment>Должен быть уникальным в пределах Года и Организации</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаТрН</name>
    <comment>Дата документа транспортная накладная.</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <comment>Юр лицо, предоставляющее груз к перевозке, отправитель докуметна(Титула) в Диадоке</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <comment>Юр. лицо, осуществляющее перевозку, получатель этого Документа(титула) в Диадоке</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <comment>Юр лицо - получатель груза (необязательно покупатель по договору)</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <comment>Транспортное средство на котором начинает исполняться перевозки</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонВодителя</name>
    <comment>приоритетнее чем указанный у водителя. телефоны могут закрепляться за ТС!</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоПогрузки</name>
    <comment>Место погрузки и начала перевозки</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ПунктыМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоДоставки</name>
    <comment>Место где заканчивается перевозка</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ПунктыМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>GLNТочкиДоставки</name>
    <comment>GLN точки доставки для EDI / торговых сетей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрузоотправительПодразделение</name>
    <comment>Если требуется особая маршрутизация в Диадоке</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ПодразделенияДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеревозчикПодразделение</name>
    <comment>Если требуется особая маршрутизация в Диадоке</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ПодразделенияДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрузополучательПодразделение</name>
    <comment>Если требуется особая маршрутизация в Диадоке</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ПодразделенияДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрузоотправительКПП</name>
    <comment>может отличаться от КПП в организации и подразделении</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПеревозчикКПП</name>
    <comment>может отличаться от КПП в организации и подразделении</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрузополучательКПП</name>
    <comment>может отличаться от КПП в организации и подразделении</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомЗак</name>
    <comment>Дата заказа (заявки) на транспорт</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗак</name>
    <comment>Дата заказа (заявки) на транспорт</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПогрузкуОсуществляет</name>
    <comment>Организация, выполняющая погрузку груза в транспортное средство (указывается если не равна Грузоотправителю)</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ПогрузкуОсуществляетПодразделение</name>
    <comment>Если требуется особая маршрутизация в Диадоке</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ПодразделенияДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ПогрузкуОсуществляетКПП</name>
    <comment>может отличаться от КПП в организации и подразделении</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительФайлаЭтоЮрЛицоОсуществляющееПогрузку</name>
    <comment>Признак что файл должен отправляться из ящика лица, осуществляющего погрузку</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПогрузкаДоговор</name>
    <comment>Договор с Организацией, осуществл. погрузку (обязателен если указана Организация осуществляющая погрузку)</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПогрузкаСотрудник</name>
    <comment>Сотрудник организации выполняющей погрузку (обязателен если указана Организация осуществляющая погрузку)</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <comment>Обязателен если тип основного транспортного средства - тягач</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп2</name>
    <comment>Второй прицеп автопоезда</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДоставки</name>
    <comment>Срок доставки произвольным текстом</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВремяДоставки</name>
    <comment>Дата и время доставки в часовом поясе пользователя формирующего документ</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутТекст</name>
    <comment>Текстовое описание маршрута</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутМашиночитаемый</name>
    <comment>Машиночитаемое описание маршрута для автоматической идентификации</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласованоВодителемПриПогрузке</name>
    <comment>Признак того что согласование было произведено. С замечаниями или без.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарииВодителяПриПогрузке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СогласованоВодителемПриВыгрузке</name>
    <comment>Признак того что согласование было произведено. С замечаниями или без.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарииВодителяПриВыгрузке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоЭкспедиция</name>
    <comment>Признак того что Заказчик перевозки не является грузоотправителем (истина)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспедицияЗаказчик</name>
    <comment>Укажите заказчика услуг, связанных с перевозкой груза. (Грузоотправителем в этом случае является экспедитор)</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспедицияДоговор</name>
    <comment>Договор на выполнение услуг по организации перевозки груза (договор экспедиции)</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратМесто</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ПунктыМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереадресовкаИсходноеМестоДоставки</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ПунктыМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратПолучатель</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереадресовкаИсходныйПолучатель</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПереадресовок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСменВодителей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСменТС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Разделитель</name>
    <type>
      <types>DefinedType.КонтурЛогистика_РазделительДокументаУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешСуммаQRКода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТестовыйДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПартнерГрузоотправитель</name>
    <comment>надсущность над контрагентами/организациями</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПартнерПеревозчик</name>
    <comment>надсущность над контрагентами, например, ТК Монополия</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПартнерГрузополучатель</name>
    <comment>надсущность над контрагентами, например, ТС Магнит</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Партнеры</types>
    </type>
  </attributes>
</mdclass:Document>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ОтборыПоСостояниюЗадач/КонтурЛогистика_ОтборыПоСостояниюЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ОтборыПоСостояниюЗадач</name>
  <enumValues>
    <name>Активные</name>
  </enumValues>
  <enumValues>
    <name>Все</name>
  </enumValues>
  <enumValues>
    <name>Завершенные</name>
  </enumValues>
  <enumValues>
    <name>Ошибки</name>
  </enumValues>
  <enumValues>
    <name>НаКонтроле</name>
  </enumValues>
  <enumValues>
    <name>Входящие</name>
  </enumValues>
  <enumValues>
    <name>МоиЗадачи</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтборСостояние = Перечисления.КонтурЛогистика_ОтборыПоСостояниюЗадач.Активные;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере_ФормаСписка(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	ЕстьНашиПВ = Справочники.КонтурЛогистика_ОрганизацииДиадок.ЕстьНашиПВВОрганизациях();
	Элементы.ФормаГруппаПеревозчик.Видимость = ЕстьНашиПВ;	
	Элементы.СписокКонтекстноеМенюГруппаПеревозчик.Видимость = ЕстьНашиПВ;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтборДинСписка();
	
	ПериодОбновления = КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ПериодОбновленияФорм");	
	
	ПодключитьОбработчикОжидания("ОбновитьСписок", ПериодОбновления, Ложь);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗавершениеФоновогоЗадания" 
		И Параметр.Свойство("КлючФЗ")
		И (Параметр.КлючФЗ = "Выполнение обмена"
		Или Параметр.КлючФЗ = "СинхронизироватьВсеГраницы") Тогда
		
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок()
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОбновитьСписок(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт

	ОтборСостояние = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ОтборыПоСостояниюЗадач.Активные");	
	УстановитьОтборДинСписка();
	ЭтаФорма.ОбновитьОтображениеДанных();

КонецПроцедуры

&НаКлиенте
Процедура ОтборСостояниеПриИзменении(Элемент)
	
	УстановитьОтборДинСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусДокументооборотаПриИзменении(Элемент)
	УстановитьОтборДинСписка();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборДинСписка()
	
	Список.Отбор.Элементы.Очистить(); 
	
	Если ЗначениеЗаполнено(ОтборСтатусДокументооборота) Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтатусДокументооборота");
		ЭлементОтбора.ПравоеЗначение = ОтборСтатусДокументооборота;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		
	КонецЕсли;
	
	Если  ОтборСостояние <> ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ОтборыПоСостояниюЗадач.Все") Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
		ЭлементОтбора.ПравоеЗначение = Ложь;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтатусДокументооборота");
		ЭлементОтбора.Использование = Истина;
		
		Если ОтборСостояние = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ОтборыПоСостояниюЗадач.Активные") Тогда
			
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
			ЭлементОтбора.ПравоеЗначение = СтатусЗавершен();
			
		ИначеЕсли ОтборСостояние = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ОтборыПоСостояниюЗадач.Завершенные") Тогда
			
			ЭлементОтбора.ПравоеЗначение = СтатусЗавершен();
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтатусЗавершен()
	Возврат НайтиСостояниеДОПоКоду("completed");
КонецФункции

&НаСервереБезКонтекста
Функция НайтиСостояниеДОПоКоду(КодАнгл, ОтвСторона = Неопределено)
	Возврат Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду(КодАнгл, ОтвСторона)
КонецФункции	


&НаКлиенте
Процедура НовыйТ1(Команда)
	
	ПараметрыФормы = Новый Структура("СозданВручную", Истина);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Документ.КонтурЛогистика_ТрН_Титул1.ФормаОбъекта",
		ПараметрыФормы, ЭтаФорма, ЭтаФорма, "ОбработчикОбновитьСписок");

КонецПроцедуры
